tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "kde-mac/kde"
tap "mscharley/homebrew"
tap "neovim/neovim"
tap "rogual/neovim-dot-app"
tap "rstacruz/backup"
cask "adoptopenjdk"
brew "ack"
brew "python"
brew "lzo"
brew "ant"
brew "apktool"
brew "aria2"
brew "asciidoc"
brew "autoconf"
brew "autojump"
brew "automake"
brew "axel"
brew "berkeley-db"
brew "c-ares"
brew "carthage"
brew "emacs"
brew "cask"
brew "cdrtools"
brew "coreutils"
brew "cscope"
brew "curl"
brew "dbus"
brew "dnsmasq"
brew "geoip"
brew "ettercap"
brew "fcitx-remote-for-osx"
brew "libvorbis"
brew "libsndfile"
brew "libsamplerate"
brew "ffmpeg"
brew "file-roller"
brew "gcc"
brew "gdb"
brew "git"
brew "git-crypt"
brew "go"
brew "gradle"
brew "graphviz"
brew "grep"
brew "libtool"
brew "guile"
brew "imagemagick"
brew "libplist"
brew "libusbmuxd"
brew "ios-webkit-debug-proxy"
brew "jenv"
brew "libgpg-error"
brew "libxml2"
brew "lua"
brew "macvim"
brew "maven"
brew "md5sha1sum", link: false
brew "mkvtoolnix"
brew "mysql"
brew "node"
brew "nativefier"
brew "neovim"
brew "nginx", link: false
brew "nmap"
brew "nvm"
brew "openvpn"
brew "privoxy"
brew "proxychains-ng"
brew "python@2"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rsync"
brew "ruby-install"
brew "scrcpy"
brew "shadowsocks-libev"
brew "socat"
brew "squid"
brew "ssh-copy-id"
brew "utf8proc"
brew "subversion"
brew "tcl-tk"
brew "tig", args: ["HEAD"]
brew "tmux"
brew "tor"
brew "transmission-cli"
brew "unison"
brew "vim", link: false
brew "watch"
brew "watchman"
brew "weechat"
brew "wget"
brew "winetricks"
brew "youtube-dl"
brew "zenity"
brew "zsh"
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus", link: false
brew "hudochenkov/sshpass/sshpass"
brew "mscharley/homebrew/alacritty"
brew "rogual/neovim-dot-app/neovim-dot-app"
cask "ableton-live-suite"
cask "android-platform-tools"
cask "background-music"
cask "baiduinput"
cask "chromium"
cask "deluge"
cask "dingtalk"
cask "google-chrome"
cask "insomnia"
cask "intellij-idea-ce"
cask "iterm2"
cask "jdownloader"
cask "keka"
cask "rambox"
cask "visual-studio-code"
